; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v8 - type_2)
 	      (pred_2 ?v2 - object ?v8 - type_2)
	      (pred_1 ?v1 - type_1 ?v7 - type_3)
	      (pred_4 ?v1 - type_1 ?v2 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v1 - type_1 ?v5 ?v6 - type_2)
       :precondition (and  (pred_3 ?v1 ?v5))
       :effect (and  (pred_3 ?v1 ?v6)
		     (not (pred_3 ?v1 ?v5))))

   (:action op_1
       :parameters (?v1 - type_1 ?v4 - object ?v3 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v3) (pred_3 ?v1 ?v3) (pred_1 ?v1 ?v7))
       :effect (and (pred_4 ?v1 ?v4 ?v7)
		    (not (pred_2 ?v4 ?v3)) 
		    (not (pred_1 ?v1 ?v7))))

   (:action op_3
       :parameters (?v1 - type_1 ?v4 - object ?v3 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v4 ?v7) (pred_3 ?v1 ?v3))
       :effect (and (pred_2 ?v4 ?v3)
		    (pred_1 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v4 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_10 - type_1
obj_12 obj_09 obj_06 obj_02 - type_3
obj_13 obj_11 obj_07 obj_05 - type_2
obj_08 obj_03 obj_04 - object)
(:init
(pred_3 obj_01 obj_05)
(pred_1 obj_01 obj_12)
(pred_1 obj_01 obj_09)
(pred_3 obj_10 obj_11)
(pred_1 obj_10 obj_06)
(pred_1 obj_10 obj_02)
(pred_2 obj_08 obj_07)
(pred_2 obj_03 obj_13)
(pred_2 obj_04 obj_07)
)
(:goal
(and
(pred_2 obj_08 obj_05)
(pred_2 obj_03 obj_13)
(pred_2 obj_04 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_01 obj_05) (pred_3 obj_10 obj_05))))
  )
)
)

; plan
1. (op_2 obj_01 obj_05 obj_07)
   deleted: (pred_3 obj_01 obj_05)
   added: (pred_3 obj_01 obj_07)
   goals met: 1 of 3
2. (op_2 obj_10 obj_11 obj_07)
   deleted: (pred_3 obj_10 obj_11)
   added: (pred_3 obj_10 obj_07)
   goals met: 1 of 3
3. (op_1 obj_01 obj_04 obj_07 obj_09)
   deleted: (pred_2 obj_04 obj_07) (pred_1 obj_01 obj_09)
   added: (pred_4 obj_01 obj_04 obj_09)
   goals met: 1 of 3
4. (op_1 obj_01 obj_08 obj_07 obj_12)
   deleted: (pred_2 obj_08 obj_07) (pred_1 obj_01 obj_12)
   added: (pred_4 obj_01 obj_08 obj_12)
   goals met: 1 of 3
5. (op_2 obj_01 obj_07 obj_05)
   deleted: (pred_3 obj_01 obj_07)
   added: (pred_3 obj_01 obj_05)
   goals met: 1 of 3
6. (op_3 obj_01 obj_04 obj_05 obj_09)
   deleted: (pred_4 obj_01 obj_04 obj_09)
   added: (pred_2 obj_04 obj_05) (pred_1 obj_01 obj_09)
   goals met: 2 of 3
7. (op_3 obj_01 obj_08 obj_05 obj_12)
   deleted: (pred_4 obj_01 obj_08 obj_12)
   added: (pred_2 obj_08 obj_05) (pred_1 obj_01 obj_12)
   goals met: 3 of 3
